In [26]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [27]:
df1=pd.read_csv('Patient_Data.csv')

In [28]:
df2=pd.read_csv('Billing_Data.csv')

In [29]:
##1 get summary
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [30]:
df1.shape

(6, 7)

In [31]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   PatientID         5 non-null      int64
 1   InsuranceCovered  5 non-null      int64
 2   FinalAmount       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [32]:
## 2 Select columns
a=df1[['PatientID','Department','Doctor','BillAmount']]
a

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [33]:
##3 drop 
df1.drop(columns=['ReceptionistID','CheckInTime'])

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [34]:
##4 Total bill amount of each department
a.groupby('Department')['BillAmount'].sum()

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [35]:
a.duplicated().sum()

1

In [36]:
##5 drop duplicates
a.drop_duplicates(inplace=True)

In [37]:
a.groupby('Department')['BillAmount'].sum()

Department
Cardiology     11200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [38]:
a.isnull().sum()

PatientID     0
Department    0
Doctor        0
BillAmount    2
dtype: int64

In [44]:
##6 fill missing value with mean
a.fillna({'BillAmount':a.BillAmount.mean()},inplace=True)
a

   PatientID   Department     Doctor   BillAmount
0        101   Cardiology  Dr. Smith  5000.000000
1        102    Neurology   Dr. John  6233.333333
2        103  Orthopedics    Dr. Lee  7500.000000
3        104   Cardiology  Dr. Smith  6200.000000
4        105  Dermatology   Dr. Rose  6233.333333

In [52]:
##7 merge two datasets
b=pd.merge(a,df2,on='PatientID',how='inner')

In [53]:

dict={'PatientID':[106,107,108],'Department':['Cardiology','Neurology','Orthopedics'],'Doctor':['Dr.Smith','Dr.John','Dr.Lee'],'BillAmount':[5000,6234,7500],'InsuranceCovered':[1000,2000,3000],'FinalAmount':[4000,3500,4500]}

In [54]:
dict

{'PatientID': [106, 107, 108],
 'Department': ['Cardiology', 'Neurology', 'Orthopedics'],
 'Doctor': ['Dr.Smith', 'Dr.John', 'Dr.Lee'],
 'BillAmount': [5000, 6234, 7500],
 'InsuranceCovered': [1000, 2000, 3000],
 'FinalAmount': [4000, 3500, 4500]}

In [55]:
df3=pd.DataFrame(dict)
df3

   PatientID   Department    Doctor  BillAmount  InsuranceCovered  FinalAmount
0        106   Cardiology  Dr.Smith        5000              1000         4000
1        107    Neurology   Dr.John        6234              2000         3500
2        108  Orthopedics    Dr.Lee        7500              3000         4500

In [68]:
##8 Concatenate new dataframe row wise

c=pd.concat([b,df3],ignore_index=True,axis=0)
c

,PatientID,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Cardiology,Dr. Smith,5000.000000,2000,3000
1,102,Neurology,Dr. John,6233.333333,1500,3500
2,103,Orthopedics,Dr. Lee,7500.000000,2500,5000
3,104,Cardiology,Dr. Smith,6200.000000,3000,3200
4,105,Dermatology,Dr. Rose,6233.333333,1000,4000
5,106,Cardiology,Dr.Smith,5000.000000,1000,4000
6,107,Neurology,Dr.John,6234.000000,2000,3500
7,108,Orthopedics,Dr.Lee,7500.000000,3000,4500

In [71]:
dict1={'MedicalCharges':[500,200,300,500,500,200,300,100],'RoomCharges':[500,300,200,500,500,300,200,400]}
dict1

{'MedicalCharges': [500, 200, 300, 500, 500, 200, 300, 100],
 'RoomCharges': [500, 300, 200, 500, 500, 300, 200, 400]}

In [72]:
d=pd.DataFrame(dict1)

In [76]:
##9 Concatenate two columns

pd.concat([c,d],ignore_index=False,axis=1)

,PatientID,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount,MedicalCharges,RoomCharges
0,101,Cardiology,Dr. Smith,5000.000000,2000,3000,500,500
1,102,Neurology,Dr. John,6233.333333,1500,3500,200,300
2,103,Orthopedics,Dr. Lee,7500.000000,2500,5000,300,200
3,104,Cardiology,Dr. Smith,6200.000000,3000,3200,500,500
4,105,Dermatology,Dr. Rose,6233.333333,1000,4000,500,500
5,106,Cardiology,Dr.Smith,5000.000000,1000,4000,200,300
6,107,Neurology,Dr.John,6234.000000,2000,3500,300,200
7,108,Orthopedics,Dr.Lee,7500.000000,3000,4500,100,400